music_app/app/models/user.rb

SELECT 1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "SfcfNaIgCGaslXXhiwivHp0m-k4"], ["LIMIT", 1]]
---
    def generate_unique_session_token
        token = SecureRandom.urlsafe_base64(20)

        while self.class.exists?(session_token: token) do

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "SfcfNaIgCGaslXXhiwivHp0m-k4"], ["updated_at", "2022-02-26 20:31:01.087558"], ["id", 4]]
---
    def reset_session_token
        self.session_token = self.generate_unique_session_token
        self.save!