music_app/app/views/albums/show.html.erb

SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = $1  [["album_id", 2]]
---
<a  href="<%= edit_album_url(@album) %>">Edit <%= @album.name %></a>
<% if @album.tracks.length > 0 %>