music_app/app/controllers/albums_controller.rb

SELECT "albums".* FROM "albums"
---
    def index
        @albums = Album.all

SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @album = Album.find(params[:id])

SELECT "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def new
        @band = Band.find(params[:band_id])

INSERT INTO "albums" ("name", "band_id", "year", "live", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "abdo"], ["band_id", 5], ["year", 1900], ["live", true], ["created_at", "2022-02-22 22:14:52.780213"], ["updated_at", "2022-02-22 22:14:52.780213"]]
---
    def create
        @album = Album.new(album_params)

        if @album.save

SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def edit
        @album = Album.find(params[:id])

SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "albums" SET "name" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["name", "jjjj"], ["updated_at", "2022-02-23 21:28:20.287613"], ["id", 3]]
---
    def update
        @album = Album.find(params[:id])
        if @album.update(album_params)

SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 3]]
---
    def destroy
        @album = Album.find(params[:id])
        @album.destroy