music_app/app/controllers/tracks_controller.rb

SELECT "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @track = Track.find(params[:id])